<?php

use yii\db\Migration;

class m160823_053321_table_map_maker extends Migration
{
    const TABLENAME = '{{%map_mark}}';
    /**
     * @inheritdoc
     */
    public function up()
    {
        $tableOptions = null;
        if ($this->db->driverName === 'mysql') {
            // http://stackoverflow.com/questions/766809/whats-the-difference-between-utf8-general-ci-and-utf8-unicode-ci
            $tableOptions = 'CHARACTER SET utf8 COLLATE utf8_unicode_ci ENGINE=InnoDB';
        }
        $this->createTable(self::TABLENAME, [
            'id' => $this->primaryKey(),
            'cid' => $this->integer(),
            'lat' => $this->string()." comment '经度'",
            'lng' => $this->string()." comment '纬度'",
        ], $tableOptions);
        $this->addForeignKey('fk-mapmark_cid-contents_id', self::TABLENAME, 'cid', '{{%contents}}', 'id', 'CASCADE', 'CASCADE');
        /*
        原始数据
    var markerArr = [{title:"吉他中国.魔菇音乐总部",content:"北京市昌平区小汤山镇阿苏卫六环国际艺术区5-1-8，电话：185-1174-6735",point:"116.365674|40.167342",isOpen:0,icon:{w:21,h:21,l:46,t:46,x:1,lb:10}}
         ,{title:"吉他中国.琴国乐器",content:"北京市朝阳区豆各庄乡黄厂路禁毒教育基地对面化工二厂院内棕灰色楼2楼&nbsp;电话：010-50139005；50139009",point:"116.55953|39.864471",isOpen:0,icon:{w:21,h:21,l:46,t:46,x:1,lb:10}}
         ,{title:"魔菇音乐北京",content:"北京市东城区交道口菊儿胡同17号南院;010-64054661",point:"116.412097|39.945649",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"吉林长春博音琴行",content:"吉林省长春市经济技术开发区&nbsp;北海路与仙台大街交汇处&nbsp;西行30米&nbsp;15500000251",point:"125.382349|43.851877",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"吉林敦化目击者音乐教室",content:"吉林省延边州&nbsp;敦化市&nbsp;胜利街鑫源居二期一楼门市&nbsp;13943351322",point:"129.379963|42.888381",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"黑龙江哈尔滨五度琴行",content:"哈尔滨市道里区地段街208号&nbsp;13936264078",point:"126.631861|45.784036",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"黑龙江大庆盛世琴行",content:"大庆市龙凤区龙八路22-21号&nbsp;18604597122",point:"125.115216|46.530918",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"辽宁沈阳音色地带",content:"沈阳市和平区五里河街昌鑫置地广场G座昌鑫公寓201室&nbsp;024-24849781",point:"123.43843|41.776403",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"辽宁大连荣和琴行",content:"辽宁省大连市西岗区水仙街6-3号&nbsp;荣和琴行&nbsp;13352203103&nbsp;1514115731",point:"121.624828|38.915385",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"江西九江维京人琴行",content:"江西省九江市浔阳区庾亮南路166号维京人琴行&nbsp;18607920183",point:"116.000179|29.72789",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"湖北宜昌黄扬现代艺术教育",content:"湖北省宜昌市亚洲广场儿童大世界二楼&nbsp;13907208989",point:"111.290121|30.709002",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"河南新乡长垣三和琴行",content:"河南省新乡市长垣铜塔寺中厅701&nbsp;13523249434",point:"114.694343|35.199285",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"山东枣庄滚石琴行",content:"山东省滕州市善国南路3号滚石琴行&nbsp;15965120008",point:"117.172585|35.085558",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"山东临朐乐声琴社",content:"山东省潍坊市临朐县民主路南段景观桥西新天地财富广场&nbsp;15318961776",point:"118.546457|36.511162",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"河北肃宁县乐声琴社",content:"河北省沧州市肃宁县东洲路与潘龙街十字路口处 &nbsp;13290675886",point:"115.846614|38.422877",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"山西太原天音吉他",content:"太原市迎泽区解放南路体育馆新视界A座903B室&nbsp;13453459810&nbsp;15534080189",point:"112.565095|37.852348",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"浙江杭州琴庐乐器",content:"浙江省杭州市西湖区高技街57号",point:"120.128596|30.291135",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"江苏扬州蓝调琴行",content:"江苏扬州文汇东路35号（文汇店）&nbsp;文汇西路166号（天和店）15952732689",point:"119.433861|32.391654",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"陕西安康桔子乐器",content:"陕西省安康市育才路4号（南京街口）17809252000",point:"109.044397|32.692665",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"吉林市吉他空间",content:"吉林市船营区柴草市46路站桩旁&nbsp;15043292294",point:"126.532808|43.832196",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"江苏江阴博海文化艺术培训",content:"江苏省江阴市澄康路28号&nbsp;15366268260",point:"120.282296|31.918024",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"山东济宁鸣堂音乐工作室",content:"山东省济宁市任城区置城国际C座0905室&nbsp;18653757808",point:"116.631905|35.437463",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"黑龙江齐齐哈尔鼎音吉他学校",content:"齐齐哈尔市龙兴嘉园7号楼6号商服、11号商服&nbsp;13100999651",point:"123.93556|47.353532",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"江苏淮安七仔艺秀房",content:"江苏省淮安市樱花路国华御锦园南门二楼&nbsp;18751285775",point:"119.057564|33.617197",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"山西晋城种子音乐",content:"山西省晋城市城区红星东街晋城市高级技师学院魔音琴行&nbsp;13935691406",point:"112.863565|35.5001",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"江西抚州悦尔琴行",content:"江西省抚州市临川区上顿度龙津路悦尔琴行&nbsp;18970953606",point:"116.361153|27.960408",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"河南鹤壁释音堂琴行",content:"河南省鹤壁市山城区地王广场c3-203&nbsp;13939275337",point:"114.192684|35.903424",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"山东滨州朵朵艺术",content:"山东省滨州市滨城区黄河七路银座中海店西100米路南，中海购物广场二楼1865430376",point:"117.9705|37.394204",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"山东胶州孚乐田现代音乐培训",content:"胶州杭州路方井园29号网点15166698776",point:"120.008676|36.283321",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"辽宁阜新市海洋吉他行",content:"辽宁省阜新市海州区新华路月亮湾步行街70-2-4门13236713045",point:"121.646852|42.008042",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"天津众人乐器",content:"天津市南开区宾水西道353号13926022392",point:"117.159499|39.085463",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"陕西西安名声乐器",content:"西安市碑林区南郭路28号18629292384",point:"108.95922|34.249836",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"江苏常州卡农琴行",content:"江苏省常州市新区河海东路211号15861833368",point:"119.995963|31.825462",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"安徽安庆阿立吉他",content:"安庆市大观区市府路与双岗路三岔口斜对面丰泽花园1栋3/4号门面15156253118",point:"117.056676|30.529649",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"山东淄博摩登琴行",content:"山东省淄博市张店区北西五路&nbsp;13001511062",point:"118.043822|36.820356",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"吉林辽源刘室鑫音乐培训中心",content:"辽源市第五中学体育馆内&nbsp;电话：13029040506",point:"125.165025|42.907211",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"贵州兴义律动琴行",content:"贵州省兴义市幸福路101号&nbsp;18685987879",point:"104.893895|25.098488",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"海南海口伯克利音乐工作室",content:"海南省海口市美兰区海甸岛二东路水岸阳光B区D栋1606&nbsp;电话：18689810899",point:"110.357276|20.056716",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"江苏无锡雲集乐器行",content:"无锡中山路123-2110&nbsp;电话：13921101766",point:"120.307632|31.581344",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"山西太原金属男孩琴行",content:"山西省太原市解放南路8号&nbsp;联系电话：13403416166",point:"112.564433|37.862469",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"四川彭州福声乐器行",content:"四川省彭州市朝阳东巷111号，四川省彭州市置信A区沃尔玛3号门斜对面80附110号&nbsp;联系电话：13518203650",point:"103.962279|30.991277",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"浙江温州苍平琴禾乐器",content:"苍南县龙港镇江滨路268-8-9号&nbsp;18968979922",point:"120.563662|27.586468",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}} 
         ,{title:"山东东营滚石琴行",content:"山东省东营市西三路20号&nbsp;电话：13792090222",point:"118.51419|37.470835",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"山东潍坊高峻吉他行",content:"山东潍坊市高新区福寿街金马路西三十米路北中百便利二楼&nbsp;电话：18663640821",point:"119.180247|36.72791",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"山东潍坊嘉誉琴行孙坤吉他",content:"山东潍坊市寒亭区泰祥街幸福路口北20米路西&nbsp;电话：18863636979",point:"119.212543|36.76783",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"内蒙古包头市福韵琴行",content:"青山店：包头市青山区文化路乙33号；昆区店：包头市昆区友谊大街北京华联东一百米&nbsp;电话：15048192339&nbsp;0472-6992896",point:"109.88962|40.672286",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"河北秦皇岛琴学社乐器",content:"河北省秦皇岛市海港区海阳路鑫园广场一层一号&nbsp;电话：18630377747",point:"119.607437|39.93665",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"陕西咸阳水一坊琴行",content:"总店：咸阳市乐育北路立交桥头印染厂门口&nbsp;分店：咸阳市防洪渠十字东南角天元小区3号楼502&nbsp;电话：18609208870",point:"108.721489|34.349219",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"山东枣庄壹68琴行",content:"山东省枣庄市薛城区中和路金泰嘉园19幢1层8、9号房&nbsp;电话：15562223336、15964454446",point:"117.284277|34.782242",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"山东泰安通韵琴行",content:"18660850805",point:"117.115112|36.20186",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"湖北仙桃吉米吉他",content:"湖北省仙桃市复州花园北门吉米吉他&nbsp;&nbsp;电话：13997991186",point:"113.447582|30.370559",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"吉林四平骅城琴行",content:"吉林省四平市铁东区第三高级中学后身民主街与前锋路交汇处&nbsp;电话：13179180707",point:"124.380878|43.168412",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"河南获嘉步步高琴房",content:"河南省获嘉县凯旋路转盘向北500米路东&nbsp;电话：13262110608",point:"113.656376|35.272225",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"广东东莞星爱琴行",content:"广东省东莞市寮步镇下岭贝培正巷59号&nbsp;联系电话：15818252210",point:"113.841655|23.023802",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"河南新乡青柠檬音乐艺术中心",content:"河南省新乡市红旗区华兰大道上海城门面107号&nbsp;电话：18637322225",point:"113.884491|35.288343",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"江苏宿迁天音琴行",content:"一店：江苏省宿迁市沭阳县南关小学北大门西侧（镇江路237号）；二店：江苏省宿迁市沭阳县第一实验小学幼儿园西门北50米&nbsp;电话：13815737444",point:"118.787732|34.134628",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"黑龙江海伦音缘琴行艺术教育中心",content:"黑龙江省海伦市一百南二道街南50米路东&nbsp;电话：15645511153",point:"126.972729|47.464053",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"河南商丘柘城超乐琴行",content:"一店：河南省商丘市柘城县文庙南街南头路西；二店：河南省商丘市柘城县二高南门&nbsp;联系电话：15903816668",point:"115.326898|34.085139",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"浙江慈溪谛听摇滚俱乐部",content:"慈溪市观海卫南大街30-10号&nbsp;联系电话：15967821654",point:"121.414278|30.174834",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"江苏盐城艺佳现代音乐培训中心",content:"江苏省盐城市射阳县恒隆广场A2005&nbsp;联系电话：18361611515",point:"120.264721|33.781092",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"山西晋中太谷乐达琴行",content:"山西省晋中市太谷县康复路安泰商铺南一号&nbsp;联系电话：13834834345",point:"112.55505|37.427776",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"北京维克艺术教育",content:"北京市锦芳路1号院旭辉奥都8号楼底商二层&nbsp;联系电话：15811111694",point:"116.422006|40.05255",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"浙江嘉善乐享音乐",content:"浙江省嘉善县罗星街道施家南路636号&nbsp;联系电话：15757359206",point:"120.940441|30.837008",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"四川乐山新锐艺术教育咨询公司",content:"四川省乐山市市中区牛耳桥文化馆&nbsp;电话：18608076270",point:"103.772146|29.577115",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"浙江宁波As爱乐琴行",content:"一店：浙江省宁波市北仑区庐山东路345号；二店：江北洪塘洪都路199号&nbsp;联系电话：13586879113",point:"121.827848|29.896005",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"四川成都享乐音乐乐器生活馆",content:"四川省成都市武侯区红瓦寺学府花园锦学阁8楼&nbsp;联系电话：18682691456",point:"104.089444|30.642207",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"湖南湘潭吉他族•音乐空间",content:"湖南省湘潭市岳塘区岚霞路289号&nbsp;联系电话：17773253375",point:"112.925444|27.833283",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"山东济宁汶上美风琴行",content:"山东省济宁市汶上县花园路镇中路口东100米路北&nbsp;联系电话：18366793379",point:"116.504287|35.729149",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"山西阳泉灵动吉他教室",content:"山西省阳泉市北大街市委党校内&nbsp;联系电话：18803534561",point:"113.580224|37.874746",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"安徽蚌埠艾威琴行",content:"安徽省蚌埠市禹会区百大拓基广场4号楼4号商铺 电话：18196613860",point:"117.349281|32.929119",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"河北保定吉英乐器商行",content:"河北省保定市白沟新城京白路336号&nbsp;电话：18332875333",point:"116.046305|39.136184",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}   
         ,{title:"黑龙江绥化传术音乐",content:"黑龙江省绥化市北二路邮局胡同&nbsp;电话：18004551357",point:"126.99776|46.646015",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"浙江台州超音吉他俱乐部",content:"浙江省台州市玉环县干江镇育才路45号&nbsp;电话：15988974679",point:"121.359548|28.172331",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"河北任丘凯歌吉他艺术中心",content:"河北省任丘市新华路科研小区北门西行50米路北秦川乐器&nbsp;&nbsp;电话：13832726280",point:"116.122682|38.710933",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"河北承德鼓舞文化传媒有限公司",content:"河北省承德市双桥区五烈路承德大剧院三楼艺术中心 电话：15333148889",point:"117.962804|40.963746",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"甘肃平凉蓝调现代音乐艺术学校",content:"甘肃省平凉市崆峒区红旗街南雅苑西侧巷内50米 电话：13649334303",point:"106.681957|35.544958",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}   
         ,{title:"河北保定M-HOUSE音乐联盟",content:"河北省保定市长城北大街东湖印象小区6-2-101室&nbsp;电话：18131299393",point:"115.530401|38.891483",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}} 
         ,{title:"内蒙古通辽天歌琴行",content:"内蒙古通辽市中心大街与永安路交汇处东100米路北&nbsp;电话：13947546781",point:"122.283523|43.624764",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}} 
         ,{title:"河北石家庄摇酷乐器",content:"河北省石家庄市桥西区中华大街工农路交口西南角万豪大厦1509&nbsp;电话：18031834890",point:"114.483188|38.037478",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}   
         ,{title:"重庆市马克琴行",content:"重庆市永川区华创步行街二期E1-27号 电话：15310088003",point:"105.936714|29.360109",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"山东烟台招远市海音乐器琴行",content:"山东省烟台招远市晨钟路58号 电话：18131299393",point:"120.404953|37.362364",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"湖南张家界民谣现代音乐学校",content:"湖南省张家界市慈利县零阳镇环城南路林业站门面 电话：13574417938",point:"111.153684|29.433682",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"江西景德镇木楼梯音乐学校",content:"江西景德镇市珠山区广场北路新德园汇民大厦 电话：18007988186",point:"117.225384|29.307622",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"上海闵行国际珍珠鼓俱乐部",content:"上海闵行区金平路557号&nbsp;电话：17701699817",point:"121.415427|31.023307",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}  
         ,{title:"吉林松原段冶吉他学校",content:"吉林省松原市宁江区和平路1419号&nbsp;电话&nbsp;18844898886",point:"124.836513|45.187588",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"上海黄浦音色地带",content:"上海市黄浦区建国西路166号&nbsp;电话：18721858626",point:"121.46036|31.210466",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"浙江临安大秦琴行",content:"浙江省临安市锦潭街营西67-68号大秦琴行&nbsp;电话：13656685506",point:"119.708527|30.23223",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}   
         ,{title:"辽宁沈阳沈北新区绿岛艺术教育",content:"辽宁省沈阳市沈北新区虎石台镇兴盛街1020幢北4&nbsp;电话：18040230207",point:"123.51955|41.949243",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"南昌市新建区龙音艺术培训",content:"南昌市新建区青岚大道南天阳光小区二期55-104店铺&nbsp;电话：18720985863",point:"115.959382|28.699142",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"南昌市马格艺术中心",content:"南昌市迎宾中大道汇仁欧尚购物中心一层B12号商铺&nbsp;电话：15979095634",point:"115.918989|28.576085",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"河南洛阳市星途琴行",content:"河南省洛阳市洛龙区翠云路龙康B区B8-9&nbsp;电话：15090187593",point:"112.469993|34.614704",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"河南省周口疯狂吉他文化艺术中心",content:"河南省周口川汇区八一路中段中国银行,电话：&nbsp;15518061204",point:"114.661463|33.625861",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"四川省绵阳市博雅琴行",content:"四川省绵阳市涪城区临园路东段59-8号；电话：&nbsp;13350000990",point:"104.750887|31.469171",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"江苏淮安盱眙先锋吉他培训中心",content:"江苏淮安盱城镇都梁北路99号金鼎华府B6幢1009室；电话：18362818671",point:"118.535964|32.999536",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}} 
         ,{title:"四川什邡本色艺术学校",content:"四川省什邡市 宏达广场 宏达商城三楼，电话：15181000405",point:"104.176303|31.132912",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ,{title:"湖南永州苏咪西西乐器有限公司",content:"湖南省永州市零陵区聚万金财富中心10层1012（一店），电话： 13874614436",point:"111.627938|26.232167",isOpen:0,icon:{w:21,h:21,l:92,t:46,x:1,lb:10}}
         ];

        */
    }

    public function down()
    {
        $this->dropForeignKey('fk-mapmark_cid-contents_id', self::TABLENAME);
        $this->dropTable(self::TABLENAME);
    }

    /*
    // Use safeUp/safeDown to run migration code within a transaction
    public function safeUp()
    {
    }

    public function safeDown()
    {
    }
    */
}
